# Import library pandas dan numpy

In [3]:
import pandas as pd
import numpy as np

In [4]:
db = pd.read_csv('books.csv')

# Tipe Dataset yang digunakan

In [5]:
db.dtypes

title                 object
author                object
google_id             object
recommender           object
recommender_count      int64
category              object
publication_date      object
pages                float64
dtype: object

# Menampilkan seluruh dataset

In [69]:
db

,title,author,google_id,recommender,recommender_count,category,publication_date,pages
0,"Surely You're Joking, Mr. Feynman!",Richard P. Feynman,_gA_DwAAQBAJ,Brian Armstrong|Ev Williams|Larry Page|Mark Zu...,8,Biography & Autobiography,2018,352.000
1,What Do You Care What Other People Think?,Richard P. Feynman,vbMIlkpQXEkC,Larry Page|Naval Ravikant,2,Biography & Autobiography,2011,256.000
2,10% Happier,Dan Harris,pINcvgEACAAJ,Peter Attia|Veronica Belmont,2,Buddhism,2017,256.000
3,100 Best-Loved Poems,Philip Smith,YzRKPwAACAAJ,Naval Ravikant,1,Poetry,1995,96.000
4,100 Great Operas And Their Stories,Henry W. Simon,KEfSAOggWXwC,Eric Weinstein,1,Music,2010,560.000
...,...,...,...,...,...,...,...,...
2998,Tragedy And Comedy,Walter Kerr,NaN,Ben Shapiro,1,NaN,NaN,NaN
2999,Trespass,Aimee Nezhukumatathil,NaN,Rolf Potts,1,NaN,NaN,NaN
3000,Tribe of Mentors,Tim Ferriss,NaN,Tony Robbins,1,NaN,NaN,NaN
3001,Wheels for the World,Douglas G. Brinkley,NaN,Paul Graham,1,NaN,NaN,NaN
3002,Work Hard. Be Nice.,Jay Mathews,NaN,Bill Gates,1,NaN,NaN,NaN

# Menampilkan jumlah record, nama atribut, dan jumlah atribut

In [70]:
jumlah_record = len(db)
nama_atribut = db.columns
jumlah_atribut = len(db.select_dtypes(include=['object']).columns)

info_dict = {'Jumlah Record' : jumlah_record,
             'Nama Atribut' : nama_atribut,
             'Jumlah Atribut' : jumlah_atribut}

# df = pd.DataFrame(info_dict)
# df.head() 
pd.Series(info_dict)

Jumlah Record                                                  3003
Nama Atribut      Index(['title', 'author', 'google_id', 'recomm...
Jumlah Atribut                                                    6
dtype: object

# Menampilkan jumlah atribut dengan tipe angka dan jumlah atribut yang memiliki nilai null

In [71]:
jumlah_atributangka = len(db.select_dtypes(include=['int64']).columns)
jumlah_NULL = len(db.columns[db.isna().sum() > 0])

dict_angka = {'Jumlah Attribut' : jumlah_atributangka,
              'Jumlah Attribut NULL' : jumlah_NULL,
}

pd.Series(dict_angka)

Jumlah Attribut         1
Jumlah Attribut NULL    4
dtype: int64

# Menampilkan rata-rata, dtandar deviasi, nilai minimum, dan nilai maksimum, Q1, Q2, Q3 dari atribut bertipe angka

In [72]:
db.describe()

       recommender_count    pages
count           3003.000 2814.000
mean               1.398  358.089
std                1.284  236.024
min                1.000    1.000
25%                1.000  240.000
50%                1.000  316.500
75%                1.000  416.000
max               22.000 5685.000

# Menampilkan nilai korelasi bertipe angka

In [73]:
db.select_dtypes(include=['int64']).corr()

                   recommender_count
recommender_count              1.000

# Merubah data bertipe int ke float

In [74]:
pd.options.display.float_format = '{:.3f}'.format
db['recommender_count'].astype('float64')

0      8.000
1      2.000
2      2.000
3      1.000
4      1.000
        ...
2998   1.000
2999   1.000
3000   1.000
3001   1.000
3002   1.000
Name: recommender_count, Length: 3003, dtype: float64

# Menampilkan 10 record pertama dari atribut bertipe angka

In [75]:
db.select_dtypes(include=['int64', 'float64']).head(10)

   recommender_count   pages
0                  8 352.000
1                  2 256.000
2                  2 256.000
3                  1  96.000
4                  1 560.000
5                  1 272.000
6                  4 320.000
7                  1 173.000
8                  1 240.000
9                  1 138.000

# Menyimpan dataset dengan atribut bertipe angka ke dalma file csv

In [68]:
db.select_dtypes(include=['int64', 'float64']).to_csv("books_bertipe_angka.csv", index = False)